wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART4_MODULE   |\ref CLK_UARTSEL0_UART4SEL_HIRC48M        |\ref CLK_UARTDIV0_UART4DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HXT            |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HIRC           |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_LXT            |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HIRC48M        |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HXT            |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HIRC           |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_LXT            |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HIRC48M        |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HXT            |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HIRC           |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_LXT            |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HIRC48M        |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HXT            |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HIRC           |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_LXT            |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_APLL0_DIV2     |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HIRC48M        |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HXT            |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HIRC           |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_LXT            |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_APLL0_DIV2     |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HIRC48M        |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref USBD0_MODULE   |\ref CLK_USBSEL_USBSEL_HIRC48M            |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBD0_MODULE   |\ref CLK_USBSEL_USBSEL_APLL1_DIV2         |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBH0_MODULE   |\ref CLK_USBSEL_USBSEL_HIRC48M            |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBH0_MODULE   |\ref CLK_USBSEL_USBSEL_APLL1_DIV2         |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_LXT               | x                              |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_HCLK2_DIV2048     | x                              |  // TESTCHIP_ONLY
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_LIRC              | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_LXT               | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_HCLK2_DIV2048     | x                              |  // TESTCHIP_ONLY
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_LIRC              | x                              |
  * |\ref WWDT0_MODULE   |\ref CLK_WWDTSEL_WWDT0SEL_HCLK0_DIV2048   | x                              |  // TESTCHIP_ONLY
  * |\ref WWDT0_MODULE   |\ref CLK_WWDTSEL_WWDT0SEL_LIRC            | x                              |  // TESTCHIP_ONLY
  * |\ref WWDT1_MODULE   |\ref CLK_WWDTSEL_WWDT1SEL_HCLK0_DIV2048   | x                              |  // TESTCHIP_ONLY
  * |\ref WWDT1_MODULE   |\ref CLK_WWDTSEL_WWDT1SEL_LIRC            | x                              |  // TESTCHIP_ONLY
  */
void CLK_SetModuleClock(uint64_t u64ModuleIdx, uint32_t u32ClkSrc, uint32_t u32ClkDiv)
{
    uint32_t u32Sel = 0UL, u32Div = 0UL;
    uint32_t u32RTCCKEN = CLK->RTCCTL & CLK_RTCCTL_RTC0CKEN_Msk;

    if (u64ModuleIdx == RTC0_MODULE)     /* RTC clock source configuration */
    {
        if (u32RTCCKEN == 0UL)
        {
            CLK->RTCCTL |= CLK_RTCCTL_RTC0CKEN_Msk; /* Enable RTC clock to get LXT clock source */
        }

        /* Select RTC clock source */
        RTC->LXTCTL = (RTC->LXTCTL & (~RTC_LXTCTL_RTCCKSEL_Msk)) | (u32ClkSrc);

        if (u32RTCCKEN == 0UL)
        {
            CLK->RTCCTL &= (~CLK_RTCCTL_RTC0CKEN_Msk); /* Disable RTC clock if it is disabled before */
        }
    }
    else /* Others clock source configuration */
    {
        /* Configure clock source divider */
        if (MODULE_CLKDIV_Msk(u64ModuleIdx) != MODULE_NoMsk)
        {
            /* Get clock divider control register address */
            u32Div = (uint32_t)MODULE_CLKDIV_BASE + ((uint32_t)MODULE_CLKDIV(u64ModuleIdx) << 2);
            /* Apply new divider */
            M32(u32Div) = (M32(u32Div) & (~((uint32_t)MODULE_CLKDIV_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx)))) | u32ClkDiv;
        }

        /* Configure clock source */
        if (MODULE_CLKSEL_Msk(u64ModuleIdx) != MODULE_NoMsk)
        {
            /* Get clock select control register address */
            u32Sel = (uint32_t)MODULE_CLKSEL_BASE + ((uint32_t)MODULE_CLKSEL(u64ModuleIdx) << 2);
            /* Set new clock selection setting */
            M32(u32Sel) = (M32(u32Sel) & (~((uint32_t)MODULE_CLKSEL_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKSEL_Pos(u64ModuleIdx)))) | u32ClkSrc;
        }
    }
}

/**
  * @brief      Set SysTick clock source
  * @param[in]  u32ClkSrc is module clock source. Including:
  *             - \ref CLK_STSEL_ST0SEL_HXT
  *             - \ref CLK_STSEL_ST0SEL_LXT
  *             - \ref CLK_STSEL_ST0SEL_HXT_DIV2
  *             - \ref CLK_STSEL_ST0SEL_ACLK_DIV2
  *             - \ref CLK_STSEL_ST0SEL_HIRC_DIV2
  * @return     None
  * @details    This function set SysTick clock source. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_SetSysTickClockSrc(uint32_t u32ClkSrc)
{
    CLK->STSEL = (CLK->STSEL & ~CLK_STSEL_ST0SEL_Msk) | u32ClkSrc;
}

/**
  * @brief      Enable clock source
  * @param[in]  u32ClkMask is clock source mask. Including :
  *             - \ref CLK_SRCCTL_HXTEN_Msk
  *             - \ref CLK_SRCCTL_LXTEN_Msk
  *             - \ref CLK_SRCCTL_MIRCEN_Msk
  *             - \ref CLK_SRCCTL_HIRCEN_Msk
  *             - \ref CLK_SRCCTL_LIRCEN_Msk
  *             - \ref CLK_SRCCTL_HIRC48MEN_Msk
  * @return     None
  * @details    This function enable clock source. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_EnableXtalRC(uint32_t u32ClkMask)
{
    /* TESTCHIP_ONLY start */
    if (u32ClkMask == CLK_SRCCTL_LXTEN_Msk)
    {
        CLK_EnableModuleClock(RTC0_MODULE);

        RTC->LXTCTL = (RTC->LXTCTL & ~RTC_LXTCTL_GAIN_Msk) | (0x7 << RTC_LXTCTL_GAIN_Pos);

        CLK_DisableModuleClock(RTC0_MODULE);
    }

