wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
    /* TESTCHIP_ONLY end */

    CLK->SRCCTL |= u32ClkMask;
}

/**
  * @brief      Disable clock source
  * @param[in]  u32ClkMask is clock source mask. Including :
  *             - \ref CLK_SRCCTL_HXTEN_Msk
  *             - \ref CLK_SRCCTL_LXTEN_Msk
  *             - \ref CLK_SRCCTL_MIRCEN_Msk
  *             - \ref CLK_SRCCTL_HIRCEN_Msk
  *             - \ref CLK_SRCCTL_LIRCEN_Msk
  *             - \ref CLK_SRCCTL_HIRC48MEN_Msk
  *             - \ref CLK_SRCCTL_APLL0EN_Msk
  *             - \ref CLK_SRCCTL_APLL1EN_Msk
  * @return     None
  * @details    This function disable clock source. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_DisableXtalRC(uint32_t u32ClkMask)
{
    CLK->SRCCTL &= ~u32ClkMask;
}

/**
  * @brief      Enable module clock
  * @param[in]  u64ModuleIdx is module index. Including :
  *             - \ref ACMP01_MODULE
  *             - \ref ACMP23_MODULE
  *             - \ref AWF0_MODULE
  *             - \ref BPWM0_MODULE
  *             - \ref BPWM1_MODULE
  *             - \ref CANFD0_MODULE
  *             - \ref CANFD1_MODULE
  *             - \ref CCAP0_MODULE
  *             - \ref CRC0_MODULE
  *             - \ref CRYPTO0_MODULE
  *             - \ref DAC01_MODULE
  *             - \ref DMIC0_MODULE
  *             - \ref EADC0_MODULE
  *             - \ref EADC1_MODULE
  *             - \ref EBI0_MODULE
  *             - \ref ECAP0_MODULE
  *             - \ref ECAP1_MODULE
  *             - \ref ECAP2_MODULE
  *             - \ref ECAP3_MODULE
  *             - \ref EMAC0_MODULE
  *             - \ref EPWM0_MODULE
  *             - \ref EPWM1_MODULE
  *             - \ref EQEI0_MODULE
  *             - \ref EQEI1_MODULE
  *             - \ref EQEI2_MODULE
  *             - \ref EQEI3_MODULE
  *             - \ref FMC0_MODULE
  *             - \ref ISP0_MODULE
  *             - \ref GDMA0_MODULE
  *             - \ref GPIOA_MODULE
  *             - \ref GPIOB_MODULE
  *             - \ref GPIOC_MODULE
  *             - \ref GPIOD_MODULE
  *             - \ref GPIOE_MODULE
  *             - \ref GPIOF_MODULE
  *             - \ref GPIOG_MODULE
  *             - \ref GPIOH_MODULE
  *             - \ref GPIOI_MODULE
  *             - \ref GPIOJ_MODULE
  *             - \ref HSOTG0_MODULE
  *             - \ref HSUSBD0_MODULE
  *             - \ref HSUSBH0_MODULE
  *             - \ref I2C0_MODULE
  *             - \ref I2C1_MODULE
  *             - \ref I2C2_MODULE
  *             - \ref I2C3_MODULE
  *             - \ref I2S0_MODULE
  *             - \ref I2S1_MODULE
  *             - \ref I3C0_MODULE
  *             - \ref KDF0_MODULE
  *             - \ref KPI0_MODULE
  *             - \ref KS0_MODULE
  *             - \ref LPADC0_MODULE
  *             - \ref LPPDMA0_MODULE
  *             - \ref LPGPIO0_MODULE
  *             - \ref LPI2C0_MODULE
  *             - \ref LPSPI0_MODULE
  *             - \ref LPSRAM0_MODULE
  *             - \ref LPTMR0_MODULE
  *             - \ref LPTMR1_MODULE
  *             - \ref LPUART0_MODULE
  *             - \ref NPU0_MODULE
  *             - \ref OTFC0_MODULE
  *             - \ref OTFC1_MODULE
  *             - \ref OTG0_MODULE
  *             - \ref PDMA0_MODULE
  *             - \ref PDMA1_MODULE
  *             - \ref PSIO0_MODULE
  *             - \ref QSPI0_MODULE
  *             - \ref QSPI1_MODULE
  *             - \ref RTC0_MODULE
  *             - \ref SC0_MODULE
  *             - \ref SC1_MODULE
  *             - \ref SC2_MODULE
  *             - \ref SCU0_MODULE
  *             - \ref SDH0_MODULE
  *             - \ref SDH1_MODULE
  *             - \ref SENTH0_MODULE
  *             - \ref SPI0_MODULE
  *             - \ref SPI1_MODULE
  *             - \ref SPI2_MODULE
  *             - \ref SPI3_MODULE
  *             - \ref SPIM0_MODULE
  *             - \ref SPIM1_MODULE
  *             - \ref SRAM0_MODULE
  *             - \ref SRAM1_MODULE
  *             - \ref SRAM2_MODULE
  *             - \ref SWDH0_MODULE
  *             - \ref SWODEC0_MODULE
  *             - \ref ST0_MODULE
  *             - \ref TAMPER0_MODULE
  *             - \ref TMR0_MODULE
  *             - \ref TMR1_MODULE
  *             - \ref TMR2_MODULE
  *             - \ref TMR3_MODULE
  *             - \ref TRNG0_MODULE
  *             - \ref TTMR0_MODULE
  *             - \ref TTMR1_MODULE
  *             - \ref UART0_MODULE
  *             - \ref UART1_MODULE
  *             - \ref UART2_MODULE
  *             - \ref UART3_MODULE
  *             - \ref UART4_MODULE
  *             - \ref UART5_MODULE
  *             - \ref UART6_MODULE
  *             - \ref UART7_MODULE
  *             - \ref UART8_MODULE
  *             - \ref UART9_MODULE
  *             - \ref USBD0_MODULE
  *             - \ref USBH0_MODULE
  *             - \ref USCI0_MODULE
  *             - \ref UTCPD0_MODULE
  *             - \ref WDT0_MODULE
  *             - \ref WDT1_MODULE
  *             - \ref WWDT0_MODULE
  *             - \ref WWDT1_MODULE
  * @retval     0  clock is not stable
  * @retval     1  clock is stable
  * @details    This function is used to enable module clock.
  */
uint32_t CLK_EnableModuleClock(uint64_t u64ModuleIdx)
{
    uint32_t u32TmpVal = 0UL, u32TmpAddr = 0UL;
    uint32_t u32Ret = 1U;

    /* Get enable bit from module index */
    u32TmpVal = (1UL << (uint32_t)MODULE_CLKEN_Pos(u64ModuleIdx));
    /* Get address bit from module index */
    u32TmpAddr = (uint32_t)MODULE_CLKCTL_BASE + (uint32_t)(MODULE_CLKCTL(u64ModuleIdx) << 2);
    /* Enable module clock */
    *(volatile uint32_t *)u32TmpAddr |= u32TmpVal;

    /* TESTCHIP_ONLY start*/
    if ((u64ModuleIdx != FMC0_MODULE) && (u64ModuleIdx != ISP0_MODULE))
    {
        u32Ret = CLK_WaitModuleClockReady(u64ModuleIdx);
    }

    /* TESTCHIP_ONLY end*/

    return u32Ret;
}

/**
  * @brief      Disable module clock
  * @param[in]  u64ModuleIdx is module index. Including :
  *             - \ref ACMP01_MODULE
  *             - \ref ACMP23_MODULE
  *             - \ref AWF0_MODULE
  *             - \ref BPWM0_MODULE
  *             - \ref BPWM1_MODULE
  *             - \ref CANFD0_MODULE
  *             - \ref CANFD1_MODULE
  *             - \ref CCAP0_MODULE
  *             - \ref CRC0_MODULE
  *             - \ref CRYPTO0_MODULE
  *             - \ref DAC01_MODULE
  *             - \ref DMIC0_MODULE
  *             - \ref EADC0_MODULE
  *             - \ref EADC1_MODULE
  *             - \ref EBI0_MODULE
  *             - \ref ECAP0_MODULE
  *             - \ref ECAP1_MODULE
  *             - \ref ECAP2_MODULE
  *             - \ref ECAP3_MODULE
  *             - \ref EMAC0_MODULE
  *             - \ref EPWM0_MODULE
  *             - \ref EPWM1_MODULE
  *             - \ref EQEI0_MODULE
  *             - \ref EQEI1_MODULE
  *             - \ref EQEI2_MODULE
  *             - \ref EQEI3_MODULE
  *             - \ref FMC0_MODULE
  *             - \ref ISP0_MODULE
  *             - \ref GDMA0_MODULE
  *             - \ref GPIOA_MODULE
  *             - \ref GPIOB_MODULE
  *             - \ref GPIOC_MODULE
  *             - \ref GPIOD_MODULE
  *             - \ref GPIOE_MODULE
  *             - \ref GPIOF_MODULE
  *             - \ref GPIOG_MODULE
  *             - \ref GPIOH_MODULE
  *             - \ref GPIOI_MODULE
  *             - \ref GPIOJ_MODULE
  *             - \ref HSOTG0_MODULE
  *             - \ref HSUSBD0_MODULE
  *             - \ref HSUSBH0_MODULE
  *             - \ref I2C0_MODULE
  *             - \ref I2C1_MODULE
  *             - \ref I2C2_MODULE
  *             - \ref I2C3_MODULE
  *             - \ref I2S0_MODULE
  *             - \ref I2S1_MODULE
  *             - \ref I3C0_MODULE
  *             - \ref KDF0_MODULE
  *             - \ref KPI0_MODULE
  *             - \ref KS0_MODULE
  *             - \ref LPADC0_MODULE
  *             - \ref LPPDMA0_MODULE
  *             - \ref LPGPIO0_MODULE
  *             - \ref LPI2C0_MODULE
  *             - \ref LPSPI0_MODULE
  *             - \ref LPSRAM0_MODULE
  *             - \ref LPTMR0_MODULE
  *             - \ref LPTMR1_MODULE
  *             - \ref LPUART0_MODULE
  *             - \ref NPU0_MODULE
  *             - \ref OTFC0_MODULE
  *             - \ref OTFC1_MODULE
  *             - \ref OTG0_MODULE
  *             - \ref PDMA0_MODULE
  *             - \ref PDMA1_MODULE
  *             - \ref PSIO0_MODULE
  *             - \ref QSPI0_MODULE
  *             - \ref QSPI1_MODULE
  *             - \ref RTC0_MODULE
  *             - \ref SC0_MODULE
  *             - \ref SC1_MODULE
  *             - \ref SC2_MODULE
  *             - \ref SCU0_MODULE
  *             - \ref SDH0_MODULE
  *             - \ref SDH1_MODULE
  *             - \ref SENTH0_MODULE
  *             - \ref SPI0_MODULE
  *             - \ref SPI1_MODULE
  *             - \ref SPI2_MODULE
  *             - \ref SPI3_MODULE
  *             - \ref SPIM0_MODULE
  *             - \ref SPIM1_MODULE
  *             - \ref SRAM0_MODULE
  *             - \ref SRAM1_MODULE
  *             - \ref SRAM2_MODULE
  *             - \ref SWDH0_MODULE
  *             - \ref SWODEC0_MODULE
  *             - \ref ST0_MODULE
  *             - \ref TAMPER0_MODULE
  *             - \ref TMR0_MODULE
  *             - \ref TMR1_MODULE
  *             - \ref TMR2_MODULE
  *             - \ref TMR3_MODULE
  *             - \ref TRNG0_MODULE
  *             - \ref TTMR0_MODULE
  *             - \ref TTMR1_MODULE
  *             - \ref UART0_MODULE
  *             - \ref UART1_MODULE
  *             - \ref UART2_MODULE
  *             - \ref UART3_MODULE
  *             - \ref UART4_MODULE
  *             - \ref UART5_MODULE
  *             - \ref UART6_MODULE
  *             - \ref UART7_MODULE
  *             - \ref UART8_MODULE
  *             - \ref UART9_MODULE
  *             - \ref USBD0_MODULE
  *             - \ref USBH0_MODULE
  *             - \ref USCI0_MODULE
  *             - \ref UTCPD0_MODULE
  *             - \ref WDT0_MODULE
  *             - \ref WDT1_MODULE
  *             - \ref WWDT0_MODULE
  *             - \ref WWDT1_MODULE
  * @return     None
  * @details    This function is used to disable module clock.
  */
void CLK_DisableModuleClock(uint64_t u64ModuleIdx)
{
    uint32_t u32TmpVal = 0UL, u32TmpAddr = 0UL;

    u32TmpVal = ~(1UL << (uint32_t)MODULE_CLKEN_Pos(u64ModuleIdx));

