wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
    u32TmpAddr = (uint32_t)MODULE_CLKCTL_BASE + (uint32_t)(MODULE_CLKCTL(u64ModuleIdx) << 2);

    *(volatile uint32_t *)u32TmpAddr &= u32TmpVal;
}

/**
  * @brief      Wait module clock ready
  * @param[in]  u64ModuleIdx is module index. Including :
  *             - \ref ACMP01_MODULE
  *             - \ref ACMP23_MODULE
  *             - \ref AWF0_MODULE
  *             - \ref BPWM0_MODULE
  *             - \ref BPWM1_MODULE
  *             - \ref CANFD0_MODULE
  *             - \ref CANFD1_MODULE
  *             - \ref CCAP0_MODULE
  *             - \ref CRC0_MODULE
  *             - \ref CRYPTO0_MODULE
  *             - \ref DAC01_MODULE
  *             - \ref DMIC0_MODULE
  *             - \ref EADC0_MODULE
  *             - \ref EADC1_MODULE
  *             - \ref EBI0_MODULE
  *             - \ref ECAP0_MODULE
  *             - \ref ECAP1_MODULE
  *             - \ref ECAP2_MODULE
  *             - \ref ECAP3_MODULE
  *             - \ref EMAC0_MODULE
  *             - \ref EPWM0_MODULE
  *             - \ref EPWM1_MODULE
  *             - \ref EQEI0_MODULE
  *             - \ref EQEI1_MODULE
  *             - \ref EQEI2_MODULE
  *             - \ref EQEI3_MODULE
  *             - \ref GDMA0_MODULE
  *             - \ref GPIOA_MODULE
  *             - \ref GPIOB_MODULE
  *             - \ref GPIOC_MODULE
  *             - \ref GPIOD_MODULE
  *             - \ref GPIOE_MODULE
  *             - \ref GPIOF_MODULE
  *             - \ref GPIOG_MODULE
  *             - \ref GPIOH_MODULE
  *             - \ref GPIOI_MODULE
  *             - \ref GPIOJ_MODULE
  *             - \ref HSOTG0_MODULE
  *             - \ref HSUSBD0_MODULE
  *             - \ref HSUSBH0_MODULE
  *             - \ref I2C0_MODULE
  *             - \ref I2C1_MODULE
  *             - \ref I2C2_MODULE
  *             - \ref I2C3_MODULE
  *             - \ref I2S0_MODULE
  *             - \ref I2S1_MODULE
  *             - \ref I3C0_MODULE
  *             - \ref KDF0_MODULE
  *             - \ref KPI0_MODULE
  *             - \ref KS0_MODULE
  *             - \ref LPADC0_MODULE
  *             - \ref LPPDMA0_MODULE
  *             - \ref LPGPIO0_MODULE
  *             - \ref LPI2C0_MODULE
  *             - \ref LPSPI0_MODULE
  *             - \ref LPSRAM0_MODULE
  *             - \ref LPTMR0_MODULE
  *             - \ref LPTMR1_MODULE
  *             - \ref LPUART0_MODULE
  *             - \ref NPU0_MODULE
  *             - \ref OTFC0_MODULE
  *             - \ref OTFC1_MODULE
  *             - \ref OTG0_MODULE
  *             - \ref PDMA0_MODULE
  *             - \ref PDMA1_MODULE
  *             - \ref PSIO0_MODULE
  *             - \ref QSPI0_MODULE
  *             - \ref QSPI1_MODULE
  *             - \ref RTC0_MODULE
  *             - \ref SC0_MODULE
  *             - \ref SC1_MODULE
  *             - \ref SC2_MODULE
  *             - \ref SCU0_MODULE
  *             - \ref SDH0_MODULE
  *             - \ref SDH1_MODULE
  *             - \ref SENTH0_MODULE
  *             - \ref SPI0_MODULE
  *             - \ref SPI1_MODULE
  *             - \ref SPI2_MODULE
  *             - \ref SPI3_MODULE
  *             - \ref SPIM0_MODULE
  *             - \ref SPIM1_MODULE
  *             - \ref SRAM0_MODULE
  *             - \ref SRAM1_MODULE
  *             - \ref SRAM2_MODULE
  *             - \ref SWDH0_MODULE
  *             - \ref SWODEC0_MODULE
  *             - \ref ST0_MODULE
  *             - \ref TAMPER0_MODULE
  *             - \ref TMR0_MODULE
  *             - \ref TMR1_MODULE
  *             - \ref TMR2_MODULE
  *             - \ref TMR3_MODULE
  *             - \ref TRNG0_MODULE
  *             - \ref TTMR0_MODULE
  *             - \ref TTMR1_MODULE
  *             - \ref UART0_MODULE
  *             - \ref UART1_MODULE
  *             - \ref UART2_MODULE
  *             - \ref UART3_MODULE
  *             - \ref UART4_MODULE
  *             - \ref UART5_MODULE
  *             - \ref UART6_MODULE
  *             - \ref UART7_MODULE
  *             - \ref UART8_MODULE
  *             - \ref UART9_MODULE
  *             - \ref USBD0_MODULE
  *             - \ref USBH0_MODULE
  *             - \ref USCI0_MODULE
  *             - \ref UTCPD0_MODULE
  *             - \ref WDT0_MODULE
  *             - \ref WDT1_MODULE
  *             - \ref WWDT0_MODULE
  *             - \ref WWDT1_MODULE
  * @retval     0  clock is not stable
  * @retval     1  clock is stable
  * @details    This function is used to wait module clock ready.
  */
/* TESTCHIP_ONLY start*/
uint32_t CLK_WaitModuleClockReady(uint64_t u64ModuleIdx)
{
    uint32_t u32TmpAddr = 0UL;
    uint32_t u32Ret = 1U;
    uint32_t u32TimeOutCnt = SystemCoreClock >> 1; /* 500ms time-out */

    /* Get address bit from module index */
    u32TmpAddr = (uint32_t)MODULE_CLKCTL_BASE + (uint32_t)(MODULE_CLKCTL(u64ModuleIdx) << 2);

    /* Check clock stable */
    while ((*(volatile uint32_t *)u32TmpAddr & BIT31) == 0UL)
    {
        if (--u32TimeOutCnt == 0)
        {
            u32Ret = 0U;
            break;
        }
    }

    return u32Ret;
}
/* TESTCHIP_ONLY end*/
/**
  * @brief      Set PLL frequency
  * @param[in]  u32PllClkSrc is PLL clock source. Including :
  *             - \ref CLK_APLLCTL_APLLSRC_HXT
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC48_DIV4
  * @param[in]  u32PllFreq is PLL frequency. The range of u32PllFreq is 25 MHz ~ 500 MHz.
  * @param[in]  u32PllSelect is PLL selection. Including :
  *             - \ref CLK_APLL0_SELECT
  *             - \ref CLK_APLL1_SELECT
  * @return     PLL frequency
  * @details    This function is used to configure PLLCTL register to set specified PLL frequency. \n
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_EnableAPLL(uint32_t u32PllClkSrc, uint32_t u32PllFreq, uint32_t u32PllSelect)
{
    uint32_t u32PllSrcClk, u32NR, u32NF, u32NO, u32PllClk, u32StableSel;
    uint32_t u32Tmp, u32Tmp2, u32Tmp3, u32Min, u32MinNF, u32MinNR;

