wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
    /* TESTCHIP_ONLY start*/
    if (u32PllClkSrc == CLK_APLLCTL_APLLSRC_HXT)
    {
        CLK_SysTickDelay(200);
    }
    else
        /* TESTCHIP_ONLY end*/
    {
        /* Wait for PLL clock stable */
        if (u32PllSelect == CLK_APLL0_SELECT)
        {
            CLK_WaitClockReady(CLK_STATUS_APLL0STB_Msk);
        }
        else
        {
            CLK_WaitClockReady(CLK_STATUS_APLL1STB_Msk);
        }
    }

    /* Return actual PLL output clock frequency */
    return u32PllClk;
}

/**
  * @brief      Disable PLL
  * @param[in]  u32PllSelect is PLL selection. Including :
  *             - \ref CLK_APLL0_SELECT
  *             - \ref CLK_APLL1_SELECT
  * @return     None
  * @details    Disable PLL. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_DisableAPLL(uint32_t u32PllSelect)
{
    if (u32PllSelect == CLK_APLL0_SELECT)
    {
        CLK->SRCCTL &= ~CLK_SRCCTL_APLL0EN_Msk;
    }
    else
    {
        CLK->SRCCTL &= ~CLK_SRCCTL_APLL1EN_Msk;
    }
}

/**
  * @brief      This function check selected clock source status
  * @param[in]  u32ClkMask is selected clock source. Including :
  *             - \ref CLK_STATUS_LIRCSTB_Msk
  *             - \ref CLK_STATUS_LXTSTB_Msk
  *             - \ref CLK_STATUS_MIRCSTB_Msk
  *             - \ref CLK_STATUS_HIRCSTB_Msk
  *             - \ref CLK_STATUS_HXTSTB_Msk
  *             - \ref CLK_STATUS_HIRC48MSTB_Msk
  *             - \ref CLK_STATUS_APLL0STB_Msk
  *             - \ref CLK_STATUS_APLL1STB_Msk
  * @retval     0  clock is not stable
  * @retval     1  clock is stable
  * @details    To wait for clock ready by specified clock source stable flag or timeout (>500ms)
  */
uint32_t CLK_WaitClockReady(uint32_t u32ClkMask)
{
    uint32_t u32TimeOutCnt = SystemCoreClock >> 1; /* 500ms time-out */
    uint32_t u32Ret = 1U;

    while ((CLK->STATUS & u32ClkMask) != u32ClkMask)
    {
        if (--u32TimeOutCnt == 0)
        {
            u32Ret = 0U;
            break;
        }
    }

    return u32Ret;
}

/**
  * @brief      This function check selected clock source status
  * @param[in]  u32ClkMask is selected clock source. Including :
  *             - \ref CLK_STATUS_LIRCSTB_Msk
  *             - \ref CLK_STATUS_LXTSTB_Msk
  *             - \ref CLK_STATUS_MIRCSTB_Msk
  *             - \ref CLK_STATUS_HIRCSTB_Msk
  *             - \ref CLK_STATUS_HXTSTB_Msk
  *             - \ref CLK_STATUS_HIRC48MSTB_Msk
  *             - \ref CLK_STATUS_APLL0STB_Msk
  *             - \ref CLK_STATUS_APLL1STB_Msk
  * @retval     0  clock is timeout
  * @retval     1  clock is disable
  * @details    To wait for clock disable by specified clock source stable flag or timeout (>500ms)
  */
uint32_t CLK_WaitClockDisable(uint32_t u32ClkMask)
{
    uint32_t u32TimeOutCnt = SystemCoreClock >> 1;

    uint32_t u32Ret = 1U;

    while (CLK->STATUS & u32ClkMask)
    {
        if (--u32TimeOutCnt == 0)
        {
            u32Ret = 0U;
            break;
        }
    }

    return u32Ret;
}

/**
  * @brief      Enable System Tick counter
  * @param[in]  u32ClkSrc is System Tick clock source. Including:
  *             - \ref CLK_STSEL_ST0SEL_HXT
  *             - \ref CLK_STSEL_ST0SEL_LXT
  *             - \ref CLK_STSEL_ST0SEL_HXT_DIV2
  *             - \ref CLK_STSEL_ST0SEL_ACLK_DIV2
  *             - \ref CLK_STSEL_ST0SEL_HIRC_DIV2
  *             - \ref CLK_STSEL_ACLK
  * @param[in]  u32Count is System Tick reload value. It could be 0~0xFFFFFF.
  * @return     None
  * @details    This function set System Tick clock source, reload value, enable System Tick counter and interrupt. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_EnableSysTick(uint32_t u32ClkSrc, uint32_t u32Count)
{
    /* Set System Tick counter disabled */
    SysTick->CTRL = 0UL;

    /* Set System Tick clock source */
    if (u32ClkSrc == CLK_STSEL_ACLK)
    {
        /* Select System Tick clock source from core clock */
        SysTick->CTRL |= SysTick_CTRL_CLKSOURCE_Msk;

        /* Disable System Tick clock source from external reference clock */
        CLK->STCTL &= ~CLK_STCTL_ST0CKEN_Msk;
    }
    else
    {
        /* Select System Tick clock source from external reference clock */
        SysTick->CTRL &= ~SysTick_CTRL_CLKSOURCE_Msk;

        /* Enable System Tick clock source from external reference clock */
        CLK->STCTL |= CLK_STCTL_ST0CKEN_Msk;

        /* Select System Tick external reference clock source */
        CLK->STSEL = (CLK->STSEL & ~CLK_STSEL_ST0SEL_Msk) | u32ClkSrc;
    }

    /* Set System Tick reload value */
    SysTick->LOAD = u32Count;

    /* Clear System Tick current value and counter flag */
    SysTick->VAL = 0UL;

    /* Set System Tick interrupt enabled and counter enabled */
    SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_ENABLE_Msk;
}

/**
  * @brief      Disable System Tick counter
  * @param      None
  * @return     None
  * @details    This function disable System Tick counter.
  */
void CLK_DisableSysTick(void)
{
    /* Set System Tick counter disabled */
    SysTick->CTRL = 0UL;
}

/**
  * @brief      Get PLL0 clock frequency
  * @param      None
  * @return     PLL0 frequency
  * @details    This function get PLL0 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetAPLL0ClockFreq(void)
{
    uint32_t u32PllFreq = 0UL, u32PllReg, u32PllReg1;
    uint32_t u32FIN, u32NF, u32NR, u32NO;
    uint8_t au8NoTbl[4] = {1U, 2U, 2U, 4U};

    u32PllReg = CLK->APLL0CTL;
    u32PllReg1 = CLK->APLL0SEL;

    if (!(CLK->SRCCTL & CLK_SRCCTL_APLL0EN_Msk))
    {
        u32PllFreq = 0UL;       /* PLL is in power down mode or fix low */
    }
    else                        /* PLL is in normal mode */
    {
        /* PLL0 source clock */
        if ((u32PllReg1 & CLK_APLL0SEL_APLLSRC_Msk) == CLK_APLLCTL_APLLSRC_HIRC)
        {
            u32FIN = __HIRC;        /* PLL0 source clock from HIRC */
        }
        else if ((u32PllReg1 & CLK_APLL0SEL_APLLSRC_Msk) == CLK_APLLCTL_APLLSRC_HXT)
        {
            u32FIN = __HXT;         /* PLL0 source clock from HXT */
        }
        else
        {
            u32FIN = __HIRC48M / 4;     /* PLL0 source clock from HIRC48M/4 */
        }

        /* Calculate PLL0 frequency */
        if (u32PllReg & CLK_APLL0CTL_BP_Msk)
        {
            u32PllFreq = u32FIN;  /* PLL0 is in bypass mode */
        }
        else
        {
            /* PLL0 is output enabled in normal work mode */
            u32NO = au8NoTbl[((u32PllReg & CLK_APLL0CTL_OUTDIV_Msk) >> CLK_APLL0CTL_OUTDIV_Pos)];
            u32NF = ((u32PllReg & CLK_APLL0CTL_FBDIV_Msk) >> CLK_APLL0CTL_FBDIV_Pos) + 2UL;
            u32NR = ((u32PllReg & CLK_APLL0CTL_INDIV_Msk) >> CLK_APLL0CTL_INDIV_Pos) + 1UL;

            /* u32FIN is shifted 2 bits to avoid overflow */
            u32PllFreq = (((u32FIN >> 2) * (u32NF << 1)) / (u32NR * u32NO) << 2);
        }
    }

    return u32PllFreq;
}

/**
  * @brief      Get PLL1 clock frequency
  * @param      None
  * @return     PLL1 frequency
  * @details    This function get PLL1 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetAPLL1ClockFreq(void)
{
    uint32_t u32PllFreq = 0UL, u32PllReg, u32PllReg1;
    uint32_t u32FIN, u32NF, u32NR, u32NO;
    uint8_t au8NoTbl[4] = {1U, 2U, 2U, 4U};

