wosayttn/lv_port_nuvoton/bsp/m55m1/Library/StdDriver/src/clk.c
    /* Get clock divider control register address */
    u32DivAddr = (uint32_t)MODULE_CLKDIV_BASE + ((uint32_t)MODULE_CLKDIV(u64ModuleIdx) << 2);

    /* Get clock divider number setting */
    u32DivVal = (inpw((uint32_t *)u32DivAddr) & (uint32_t)(MODULE_CLKDIV_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx))) >> (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx);

    return u32DivVal;
}

/**
  * @brief      Set system and bus clock
  * @param[in]  u32SCLKSrc is SCLK clock source. Including :
  *             - \ref CLK_SCLKSEL_SCLKSEL_HIRC
  *             - \ref CLK_SCLKSEL_SCLKSEL_MIRC
  *             - \ref CLK_SCLKSEL_SCLKSEL_HIRC48M
  *             - \ref CLK_SCLKSEL_SCLKSEL_HXT
  *             - \ref CLK_SCLKSEL_SCLKSEL_APLL0
  * @brief      Set PLL frequency
  * @param[in]  u32PllClkSrc is PLL clock source. Including :
  *             - \ref CLK_APLLCTL_APLLSRC_HXT
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC48_DIV4
  *             u32PllClkSrc is ignored when u32SCLKSrc is not CLK_SCLKSEL_SCLKSEL_APLL0.
  * @param[in]  u32PllFreq is PLL frequency. The range of u32PllFreq is 50 MHz ~ 500 MHz.
  *             u32PllFreq is ignored when u32SCLKSrc is not CLK_SCLKSEL_SCLKSEL_APLL0.
  * @return     Current SCLK frequency
  * @details    This function is used to set the SCLK/HCLK/PCLK with clock limitations. \n
  *             The clock limitation as following below :
  *             ACLK is 200MHz
  *             HCLK0/HCLK1 is 200MHz
  *             HCLK2 is 100MHz
  *             PCLK0/PCLK1/PCLK2/PCLK3 is 100MHz
  *             PCLK4 is 50MHz
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_SetBusClock(uint32_t u32SCLKSrc, uint32_t u32PllClkSrc, uint32_t u32PllFreq)
{
    uint32_t u32PllClk;

    if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_APLL0)
    {
        /* Select SCLK to HIRC before APLL setting*/
        CLK_SetSCLK(CLK_SCLKSEL_SCLKSEL_HIRC);

        /* Enable APLL0 clock */
        u32PllClk = CLK_EnableAPLL(u32PllClkSrc, u32PllFreq, CLK_APLL0_SELECT);

        /* Set clock with limitations */
        if (u32PllClk > FREQ_200MHZ)
        {
            CLK_SET_HCLK2DIV(3);
            CLK_SET_PCLK0DIV(3);
            CLK_SET_PCLK1DIV(3);
            CLK_SET_PCLK2DIV(3);
            CLK_SET_PCLK3DIV(3);
            CLK_SET_PCLK4DIV(3);
        }
        else if (u32PllClk > FREQ_100MHZ)
        {
            CLK_SET_HCLK2DIV(2);
            CLK_SET_PCLK0DIV(2);
            CLK_SET_PCLK1DIV(2);
            CLK_SET_PCLK2DIV(2);
            CLK_SET_PCLK3DIV(2);
            CLK_SET_PCLK4DIV(2);
        }
        else if (u32PllClk > FREQ_50MHZ)
        {
            CLK_SET_HCLK2DIV(1);
            CLK_SET_PCLK0DIV(1);
            CLK_SET_PCLK1DIV(1);
            CLK_SET_PCLK2DIV(1);
            CLK_SET_PCLK3DIV(1);
            CLK_SET_PCLK4DIV(2);
        }
        else
        {
            CLK_SET_HCLK2DIV(1);
            CLK_SET_PCLK0DIV(1);
            CLK_SET_PCLK1DIV(1);
            CLK_SET_PCLK2DIV(1);
            CLK_SET_PCLK3DIV(1);
            CLK_SET_PCLK4DIV(1);
        }
    }
    else
    {
        if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_MIRC)
        {
            /* Enable internal medium speed RC clock */
            CLK_EnableXtalRC(CLK_SRCCTL_MIRCEN_Msk);

            /* Waiting for internal medium speed clock ready */
            CLK_WaitClockReady(CLK_STATUS_MIRCSTB_Msk);
        }
        else if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_HIRC48M)
        {
            /* Enable internal RC 48MHz clock */
            CLK_EnableXtalRC(CLK_SRCCTL_HIRC48MEN_Msk);

            /* Waiting for internal RC 48MHz clock ready */
            CLK_WaitClockReady(CLK_STATUS_HIRC48MSTB_Msk);
        }
        else if (u32SCLKSrc == CLK_SCLKSEL_SCLKSEL_HXT)
        {
            /* Enable external high speed crystal clock */
            CLK_EnableXtalRC(CLK_SRCCTL_HXTEN_Msk);

            /* Waiting for external high speed crystal clock ready */
            CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);
        }
        else
        {
            /* Enable Internal RC 12MHz clock */
            CLK_EnableXtalRC(CLK_SRCCTL_HIRCEN_Msk);

            /* Waiting for Internal RC clock ready */
            CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
        }

        /* Release clock limitations */
        CLK_SET_HCLK2DIV(1);
        CLK_SET_PCLK0DIV(1);
        CLK_SET_PCLK1DIV(1);
        CLK_SET_PCLK2DIV(1);
        CLK_SET_PCLK3DIV(1);
        CLK_SET_PCLK4DIV(1);
    }

    /* Switch SCLK clock */
    CLK_SetSCLK(u32SCLKSrc);

    return SystemCoreClock;
}

/**
  * @brief      This function execute delay function.
  * @param[in]  us  Delay time. The Max value is 2^24 / CPU Clock(MHz). Ex:
  *                             200MHz => 83886us, 180MHz => 93206us ...
  * @return     None
  * @details    Use the SysTick to generate the delay time and the unit is in us.
  *             The SysTick clock source is from HCLK, i.e the same as system core clock.
  *             User can use SystemCoreClockUpdate() to calculate CyclesPerUs automatically before using this function.
  */
void CLK_SysTickDelay(uint32_t us)
{
    uint32_t u32TargetValue, u32TargetInt, u32TargetRem, u32DelayCycles;

    /* Systick function is using and clock source is core clock */
    if ((SysTick->CTRL & (SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk)) == (SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk))
    {
        u32DelayCycles = us * CyclesPerUs;

        if (u32DelayCycles > SysTick->LOAD)
        {
            /* Calculate re-load cycles with current SysTick->LOAD */
            u32TargetInt = u32DelayCycles / SysTick->LOAD;

            /* Calculate remainder delay cycles */
            u32TargetRem = u32DelayCycles % SysTick->LOAD;
        }
        else
        {
            u32TargetInt = 0;
            u32TargetRem = u32DelayCycles;
        }

        if (u32TargetRem > SysTick->VAL)
        {
            u32TargetValue = SysTick->LOAD;
            u32TargetValue = u32TargetValue - (u32TargetRem - SysTick->VAL);
            u32TargetInt++;
        }
        else
        {
            u32TargetValue = SysTick->VAL - u32TargetRem;
        }

        while (u32TargetInt > 0)
        {
            /* Waiting for down-count to zero */
            while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0UL)
            {
            }

